# Клавиатура имеет следующую раскладку:

#┌───┬───┬───┐
#│ 1 │ 2 │ 3 │
#├───┼───┼───┤
#│ 4 │ 5 │ 6 │
#├───┼───┼───┤
#│ 7 │ 8 │ 9 │
#└───┼───┼───┘
#    │ 0 │
#    └───┘
#
# В PIN-коде каждая из цифр может быть другой соседней цифрой (по горизонтали или вертикали, но не по диагонали). Например. вместо 1 это также может быть 2 или 4. И вместо 5 это также может быть 2, 4, 6 или 8.

# * возможно в смысле: самого наблюдаемого ПИН-кода и всех его вариаций с учетом соседних цифр.

# Напишите функцию возвращающую массив всех вариантов наблюдаемого PIN-кода длиной от 1 до 8 цифр. Но обратите внимание, что все ПИН-коды, как наблюдаемый, так и результаты, должны быть строками, поскольку потенциально могут начинаться с нулей.

def get_pins(observed)
  # your code
end
